app/controllers/gifs_controller.rb

  def index
    @gifs = Gif.order("created_at DESC")
---
SELECT "gifs".* FROM "gifs"  ORDER BY created_at DESC

  def create
    @gif = Gif.new(gif_params)
    @gif.user_id = current_user.id
    respond_to do |format|
      if @gif.save
---
INSERT INTO "gifs" ("description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Sansa Stark"], ["picture", "https://media0.giphy.com/media/vTuqQcc0XOXRu/200.gif"], ["created_at", "2015-08-14 13:24:16.803082"], ["updated_at", "2015-08-14 13:24:16.803082"]]

  def update
    respond_to do |format|
      if @gif.update(gif_params)
---
UPDATE "gifs" SET "description" = ?, "picture" = ?, "updated_at" = ? WHERE "gifs"."id" = ?  [["description", "Hello"], ["picture", "OK"], ["updated_at", "2015-08-14 13:57:35.474711"], ["id", 1]]

  def destroy
    @gif.destroy
---
DELETE FROM "gifs" WHERE "gifs"."id" = ?  [["id", 1]]

    def set_gif
      @gif = Gif.find(params[:id])
---
SELECT  "gifs".* FROM "gifs" WHERE "gifs"."id" = ? LIMIT 1  [["id", 1]]